# Problem Names

In [14]:
# import all packages
import pandas as pd #note -pandas library is already installed
import numpy as np # note - numpy library is already installed

#import data files as pandas dataframes
filepath = 'TitanicData.csv'

df = pd.read_csv(filepath)  #telling it to grab the pd file and read it

df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,80.0,0,0,27042,30.0000,A23,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,76.0,1,0,19877,78.8500,C46,S
2,3,1,3,"Heikkinen, Miss. Laina",male,74.0,0,0,347060,7.7750,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",male,71.0,0,0,PC 17754,34.6542,A5,C
4,5,0,3,"Allen, Mr. William Henry",male,71.0,0,0,PC 17609,49.5042,NaN,C

## Splitting the Names Column

In [15]:
df[['Surname','TempName1']] = df['Name'].str.split(',', expand=True)
df[['Surname','TempName1']]

            Surname                                    TempName1
0            Braund                              Mr. Owen Harris
1           Cumings   Mrs. John Bradley (Florence Briggs Thayer)
2         Heikkinen                                  Miss. Laina
3          Futrelle           Mrs. Jacques Heath (Lily May Peel)
4             Allen                            Mr. William Henry
...             ...                                          ...
1304        Spector                                    Mr. Woolf
1305  Oliva y Ocana                                Dona. Fermina
1306        Saether                          Mr. Simon Sivertsen
1307           Ware                                Mr. Frederick
1308          Peter                            Master. Michael J

[1309 rows x 2 columns]

In [47]:
df[['Prefix','TempName2','TempName3']] = df['TempName1'].str.split('.', expand=True)
df[['Prefix','TempName2','TempName3']]

       Prefix                               TempName2 TempName3
0          Mr                             Owen Harris      None
1         Mrs   John Bradley (Florence Briggs Thayer)      None
2        Miss                                   Laina      None
3         Mrs           Jacques Heath (Lily May Peel)      None
4          Mr                           William Henry      None
...       ...                                     ...       ...
1304       Mr                                   Woolf      None
1305     Dona                                 Fermina      None
1306       Mr                         Simon Sivertsen      None
1307       Mr                               Frederick      None
1308   Master                               Michael J      None

[1309 rows x 3 columns]

In [49]:
df[['GName','SDGName','TempName4']]=df['TempName2'].str.split('(',expand=True)
df[['GName','SDGName','TempName4']]

                 GName                  SDGName TempName4
0          Owen Harris                     None      None
1        John Bradley   Florence Briggs Thayer)      None
2                Laina                     None      None
3       Jacques Heath            Lily May Peel)      None
4        William Henry                     None      None
...                ...                      ...       ...
1304             Woolf                     None      None
1305           Fermina                     None      None
1306   Simon Sivertsen                     None      None
1307         Frederick                     None      None
1308         Michael J                     None      None

[1309 rows x 3 columns]

In [50]:
df[['SDGName','TempName5']] = df['SDGName'].str.split(')',expand=True)
df[['SDGName','TempName5']]

                     SDGName TempName5
0                       None      None
1     Florence Briggs Thayer
2                       None      None
3              Lily May Peel
4                       None      None
...                      ...       ...
1304                    None      None
1305                    None      None
1306                    None      None
1307                    None      None
1308                    None      None

[1309 rows x 2 columns]

In [53]:
df.to_csv('titanic_check.csv')

### Finding Passenger 514

In [51]:
name_temp3 = df.loc[df['TempName3'].notnull(),['TempName1','TempName3']]
display(name_temp3)

                               TempName1  TempName3
513   Mrs. Martin (Elizabeth L. Barrett)   Barrett)

### Finding Passenger 557

In [54]:
name_temp4 = df.loc[df['TempName4'].notnull(),['TempName1','TempName4']]
display(name_temp4)

                                             TempName1      TempName4
556   Lady. (Lucille Christiana Sutherland) ("Mrs M...  "Mrs Morgan")

### Finding Passenger 760

In [56]:
theCountess = df.loc[df['Prefix'] == ' the Countess',['TempName1','Prefix']]
display(theCountess)

                                             TempName1         Prefix
759   the Countess. of (Lucy Noel Martha Dyer-Edwards)   the Countess

# Cabins Split

# 1. Splitting Cells With Multiple Cabin Numbers

In [59]:
df[['Cabin1','Cabin2','Cabin3','Cabin4']] = df['Cabin'].str.split(' ', expand=True)
df[['Cabin1','Cabin2','Cabin3','Cabin4']]

     Cabin1 Cabin2 Cabin3 Cabin4
0       A23   None   None   None
1       C46   None   None   None
2       NaN    NaN    NaN    NaN
3        A5   None   None   None
4       NaN    NaN    NaN    NaN
...     ...    ...    ...    ...
1304    NaN    NaN    NaN    NaN
1305    NaN    NaN    NaN    NaN
1306    NaN    NaN    NaN    NaN
1307    NaN    NaN    NaN    NaN
1308    NaN    NaN    NaN    NaN

[1309 rows x 4 columns]

## 2. Extracting The Deck Letter

In [66]:
df['Deck'] = df['Cabin'].str[0]
df[['Deck']]

     Deck
0       A
1       C
2     NaN
3       A
4     NaN
...   ...
1304  NaN
1305  NaN
1306  NaN
1307  NaN
1308  NaN

[1309 rows x 1 columns]

## 3. Finding The Problem Cabin Numbers

In [68]:
cabin_prob1 = df.loc[df['Cabin3'].notnull(),['Cabin','Cabin3']]
display(cabin_prob1)

               Cabin Cabin3
13       C23 C25 C27    C27
30   B57 B59 B63 B66    B63
38       C23 C25 C27    C27
48       B51 B53 B55    B55
118      B52 B54 B56    B56
128  B57 B59 B63 B66    B63
310      B51 B53 B55    B55
376      B51 B53 B55    B55
535      C23 C25 C27    C27
651      C23 C25 C27    C27
686      C23 C25 C27    C27
777  B57 B59 B63 B66    B63
821      C23 C25 C27    C27
859  B57 B59 B63 B66    B63
949  B57 B59 B63 B66    B63

In [69]:
cabin_prob2 = df.loc[df['Cabin4'].notnull(),['Cabin','Cabin4']]
display(cabin_prob2)

               Cabin Cabin4
30   B57 B59 B63 B66    B66
128  B57 B59 B63 B66    B66
777  B57 B59 B63 B66    B66
859  B57 B59 B63 B66    B66
949  B57 B59 B63 B66    B66